In [1]:
import pandas as pd

In [2]:
# Create a Pandas Series
series = pd.Series([1, 4, 6, 9, 7], index=['a', 'x', 'c', '2', 'e'])

# Print the series
print(series)

a    1
x    4
c    6
2    9
e    7
dtype: int64

In [3]:
# Create a Pandas Series
series = pd.Series([42,38,39], index=['Bilal','Ayesha','Hadia'])

# Print the series
print(series)

Bilal     42
Ayesha    38
Hadia     39
dtype: int64

In [4]:
# Create a Python dictionary with the data
data = {
    'Day': ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017','1/5/2017','1/6/2017'],
    'Temperature': [32,25,28,24,32,31],
    'Windspeed': [6,7,2,7,4,2],
    'Event':['Rain','Sunny','Snow','Snow','Rain','Sunny']
}

# Create a Pandas DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

        Day  Temperature  Windspeed  Event
0  1/1/2017           32          6   Rain
1  1/2/2017           25          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [5]:
df = pd.DataFrame(data, index=['a', 'b', 'c', 'd','e','f'])
df

        Day  Temperature  Windspeed  Event
a  1/1/2017           32          6   Rain
b  1/2/2017           25          7  Sunny
c  1/3/2017           28          2   Snow
d  1/4/2017           24          7   Snow
e  1/5/2017           32          4   Rain
f  1/6/2017           31          2  Sunny

In [6]:
# Get the minimum and maximum values for the 'Temperature' column
min_temp = df['Temperature'].min()
max_temp = df['Temperature'].max()

# Print the results
print("Minimum age:", min_temp)
print("Maximum age:", max_temp)

Minimum age: 24
Maximum age: 32

In [7]:
# Read specific columns from a CSV file into a DataFrame
specific = ["First Name", "Sex", "Email", "Phone", "Job Title"]
df = pd.read_csv('people.csv', usecols=specific)

# Display the first five rows of the DataFrame
print(df.head())

  First Name     Sex                       Email                   Phone  \
0     Shelby    Male        elijah57@example.net  001-084-906-7849x73518
1    Phillip  Female       bethany14@example.com       214.112.6044x4913
2   Kristine    Male       bthompson@example.com            277.609.7938
3    Yesenia    Male   kaitlinkaiser@example.com            584.094.6111
4       Lori    Male  buchananmanuel@example.net       689-207-3558x7233

            Job Title
0     Games developer
1      Phytotherapist
2           Homeopath
3   Market researcher
4  Veterinary surgeon

In [8]:
# Set "Sex" and "Job Title" columns as index
df.set_index(["Sex", "Job Title"], inplace=True)

# Display the DataFrame with the new index
print(df)

                             First Name                       Email  \
Sex    Job Title
Male   Games developer           Shelby        elijah57@example.net
Female Phytotherapist           Phillip       bethany14@example.com
Male   Homeopath               Kristine       bthompson@example.com
       Market researcher        Yesenia   kaitlinkaiser@example.com
       Veterinary surgeon          Lori  buchananmanuel@example.net
...                                 ...                         ...
Female Software engineer         Dennis         bmartin@example.org
       Barrister                  Steve       latasha46@example.net
Male   Police officer            Wesley        regina11@example.org
Female Broadcast journalist      Summer  alexiscantrell@example.org
Male   IT sales professional     Mariah       pcopeland@example.org

                                               Phone
Sex    Job Title
Male   Games developer        001-084-906-7849x73518
Female Phytotherapist              214.112.6044x4913
Male   Homeopath                        277.609.7938
       Market researcher                584.094.6111
       Veterinary surgeon          689-207-3558x7233
...                                              ...
Female Software engineer        001-095-524-2112x257
       Barrister                    001-865-478-5157
Male   Police officer             995-542-3004x76800
Female Broadcast journalist     001-273-685-6932x092
Male   IT sales professional     (341)594-6554x44657

[100 rows x 3 columns]

In [9]:
skip_rows = [1, 5]  # Rows to skip
df = pd.read_csv('people.csv', usecols=specific, skiprows=skip_rows)

# Display the DataFrame
print(df)

   First Name     Sex                       Email                  Phone  \
0     Phillip  Female       bethany14@example.com      214.112.6044x4913
1    Kristine    Male       bthompson@example.com           277.609.7938
2     Yesenia    Male   kaitlinkaiser@example.com           584.094.6111
3        Erin    Male         tconner@example.org  001-171-649-9856x5553
4   Katherine  Female     conniecowan@example.com  +1-773-151-6685x49162
..        ...     ...                         ...                    ...
93     Dennis  Female         bmartin@example.org   001-095-524-2112x257
94      Steve  Female       latasha46@example.net       001-865-478-5157
95     Wesley    Male        regina11@example.org     995-542-3004x76800
96     Summer  Female  alexiscantrell@example.org   001-273-685-6932x092
97     Mariah    Male       pcopeland@example.org    (341)594-6554x44657

                   Job Title
0             Phytotherapist
1                  Homeopath
2          Market researcher
3   Waste management officer
4       Intelligence analyst
..                       ...
93         Software engineer
94                 Barrister
95            Police officer
96      Broadcast journalist
97     IT sales professional

[98 rows x 5 columns]

In [10]:
df.to_csv('NewPeople.csv', index=False)

print("DataFrame exported to NewPeople.csv")

DataFrame exported to NewPeople.csv

In [11]:

# Read the Excel sheet into a DataFrame
df = pd.read_excel('SampleWork.xlsx')

# Display the DataFrame
print(df)

     Name  Age   Stream  Percentage
0    Amir   18     Math          95
1   Bilal   19  Science          90
2  Sufyan   20  Comerce          85
3   Saiqa   18     Math          80
4   Aimen   32  Science          75

In [12]:
df = pd.read_excel('SampleWork.xlsx', sheet_name=0)
df

     Name  Age   Stream  Percentage
0    Amir   18     Math          95
1   Bilal   19  Science          90
2  Sufyan   20  Comerce          85
3   Saiqa   18     Math          80
4   Aimen   32  Science          75

In [13]:
# Select the first and last column labels
first_column_label = df.columns[0]
last_column_label = df.columns[-1]

# Extract the first and last columns into a new DataFrame
first_column = df[first_column_label]
last_column = df[last_column_label]

# Create a DataFrame with only the first and last columns
result_df = pd.concat([first_column, last_column], axis=1)

# Display the resulting DataFrame
print(result_df)

     Name  Percentage
0    Amir          95
1   Bilal          90
2  Sufyan          85
3   Saiqa          80
4   Aimen          75

In [14]:
df = pd.read_excel('SampleWork.xlsx', sheet_name=0,skiprows=[1])
df

     Name  Age   Stream  Percentage
0   Bilal   19  Science          90
1  Sufyan   20  Comerce          85
2   Saiqa   18     Math          80
3   Aimen   32  Science          75

In [15]:
df = pd.read_excel('SampleWork.xlsx', sheet_name=0,skiprows=[1],header=1)
df

    Bilal  19  Science  90
0  Sufyan  20  Comerce  85
1   Saiqa  18     Math  80
2   Aimen  32  Science  75

In [16]:
# Export the header DataFrame as a new sheet in the Excel file
df.to_excel('Header.xlsx', sheet_name='Header', index=False)

print("Header exported as 'Header' sheet in Header.xlsx")

Header exported as 'Header' sheet in Header.xlsx

In [17]:
# Create the DataFrame
data = {
    'Name': ['Sonia', 'Bilal', 'Hifza', 'Kabir', 'Jazim'],
    'Age': [27,24,22,32,23],
    'Address': ['Lahore','Karachi','Sialkot','Peshawar','lhr'], 
    'Qualification': ['MBA', 'PhD', 'BSc', 'MSc', 'BSc']
}

AICP_DF = pd.DataFrame(data)
AICP_DF

    Name  Age   Address Qualification
0  Sonia   27    Lahore           MBA
1  Bilal   24   Karachi           PhD
2  Hifza   22   Sialkot           BSc
3  Kabir   32  Peshawar           MSc
4  Jazim   23       lhr           BSc

In [18]:
df1 = AICP_DF[['Name', 'Qualification']]
df1

    Name Qualification
0  Sonia           MBA
1  Bilal           PhD
2  Hifza           BSc
3  Kabir           MSc
4  Jazim           BSc

In [19]:
AICP_DF['Height'] = [5.1, 6.2, 5.1, 5.2, 5.1]
AICP_DF

    Name  Age   Address Qualification  Height
0  Sonia   27    Lahore           MBA     5.1
1  Bilal   24   Karachi           PhD     6.2
2  Hifza   22   Sialkot           BSc     5.1
3  Kabir   32  Peshawar           MSc     5.2
4  Jazim   23       lhr           BSc     5.1

In [20]:
a=AICP_DF.set_index('Name', inplace=True)
a

In [21]:
row_Hifza = AICP_DF.loc['Hifza']
row_Hifza

Age                   22
Address          Sialkot
Qualification        BSc
Height               5.1
Name: Hifza, dtype: object

In [22]:
row_index_3 = AICP_DF.iloc[3]
row_index_3

Age                    32
Address          Peshawar
Qualification         MSc
Height                5.2
Name: Kabir, dtype: object

In [23]:
AICP_DF.drop(index='Bilal', inplace=True)
AICP_DF

       Age   Address Qualification  Height
Name
Sonia   27    Lahore           MBA     5.1
Hifza   22   Sialkot           BSc     5.1
Kabir   32  Peshawar           MSc     5.2
Jazim   23       lhr           BSc     5.1